load_testing/results_for_report/long_comp/cons_hash_3_peaks_360s_10keys_1600r.txt
CONNECTED to addr	172.31.11.13:3000
CONNECTED to addr	172.31.10.136:3000
all addrs:
1	172.31.11.13:3000
2	172.31.10.136:3000
thread addr: 172.31.11.13:3000
all addrs:
1	172.31.11.13:3000
2	172.31.10.136:3000
thread addr: 172.31.10.136:3000
Running 6m test @ http://172.31.11.13:3000
  2 threads and 200 connections
  Thread calibration: mean lat.: 292.665ms, rate sampling interval: 1773ms
  Thread calibration: mean lat.: 302.588ms, rate sampling interval: 1888ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.47s     1.98s   18.28s    89.69%
    Req/Sec   799.86     58.20     1.10k    87.17%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  819.20ms
 75.000%    1.96s 
 90.000%    3.51s 
 99.000%   10.15s 
 99.900%   13.38s 
 99.990%   15.67s 
 99.999%   17.76s 
100.000%   18.30s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.485     0.000000            1         1.00
       5.691     0.100000        55949         1.11
      61.663     0.200000       111839         1.25
     283.135     0.300000       167796         1.43
     536.063     0.400000       223750         1.67
     819.199     0.500000       279603         2.00
     989.183     0.550000       307636         2.22
    1186.815     0.600000       335606         2.50
    1415.167     0.650000       363572         2.86
    1660.927     0.700000       391474         3.33
    1959.935     0.750000       419468         4.00
    2129.919     0.775000       433379         4.44
    2318.335     0.800000       447352         5.00
    2537.471     0.825000       461328         5.71
    2791.423     0.850000       475379         6.67
    3094.527     0.875000       489323         8.00
    3291.135     0.887500       496279         8.89
    3514.367     0.900000       503289        10.00
    3801.087     0.912500       510297        11.43
    4184.063     0.925000       517250        13.33
    4685.823     0.937500       524237        16.00
    5009.407     0.943750       527734        17.78
    5378.047     0.950000       531252        20.00
    5779.455     0.956250       534739        22.86
    6258.687     0.962500       538236        26.67
    6955.007     0.968750       541717        32.00
    7430.143     0.971875       543461        35.56
    7819.263     0.975000       545226        40.00
    8220.671     0.978125       546959        45.71
    8724.479     0.981250       548712        53.33
    9281.535     0.984375       550447        64.00
    9576.447     0.985938       551342        71.11
    9789.439     0.987500       552222        80.00
   10018.815     0.989062       553098        91.43
   10239.999     0.990625       553957       106.67
   10469.375     0.992188       554827       128.00
   10608.639     0.992969       555267       142.22
   10805.247     0.993750       555691       160.00
   11018.239     0.994531       556141       182.86
   11255.807     0.995313       556563       213.33
   11509.759     0.996094       557002       256.00
   11640.831     0.996484       557221       284.44
   11788.287     0.996875       557438       320.00
   11993.087     0.997266       557656       365.71
   12247.039     0.997656       557884       426.67
   12525.567     0.998047       558096       512.00
   12681.215     0.998242       558203       568.89
   12820.479     0.998437       558314       640.00
   12951.551     0.998633       558426       731.43
   13189.119     0.998828       558529       853.33
   13402.111     0.999023       558638      1024.00
   13524.991     0.999121       558694      1137.78
   13680.639     0.999219       558748      1280.00
   13869.055     0.999316       558802      1462.86
   14131.199     0.999414       558859      1706.67
   14352.383     0.999512       558911      2048.00
   14426.111     0.999561       558939      2275.56
   14540.799     0.999609       558968      2560.00
   14606.335     0.999658       558995      2925.71
   14721.023     0.999707       559022      3413.33
   14901.247     0.999756       559048      4096.00
   14991.359     0.999780       559063      4551.11
   15114.239     0.999805       559076      5120.00
   15220.735     0.999829       559091      5851.43
   15343.615     0.999854       559103      6826.67
   15548.415     0.999878       559118      8192.00
   15597.567     0.999890       559124      9102.22
   15745.023     0.999902       559130     10240.00
   15876.095     0.999915       559137     11702.86
   16064.511     0.999927       559144     13653.33
   16277.503     0.999939       559150     16384.00
   16515.071     0.999945       559155     18204.44
   16637.951     0.999951       559157     20480.00
   16908.287     0.999957       559162     23405.71
   17022.975     0.999963       559164     27306.67
   17186.815     0.999969       559168     32768.00
   17219.583     0.999973       559169     36408.89
   17465.343     0.999976       559171     40960.00
   17481.727     0.999979       559174     46811.43
   17481.727     0.999982       559174     54613.33
   17514.495     0.999985       559176     65536.00
   17629.183     0.999986       559177     72817.78
   17760.255     0.999988       559178     81920.00
   17776.639     0.999989       559179     93622.86
   17776.639     0.999991       559179    109226.67
   17907.711     0.999992       559180    131072.00
   18022.399     0.999993       559181    145635.56
   18022.399     0.999994       559181    163840.00
   18137.087     0.999995       559182    187245.71
   18137.087     0.999995       559182    218453.33
   18137.087     0.999996       559182    262144.00
   18186.239     0.999997       559183    291271.11
   18186.239     0.999997       559183    327680.00
   18186.239     0.999997       559183    374491.43
   18186.239     0.999998       559183    436906.67
   18186.239     0.999998       559183    524288.00
   18300.927     0.999998       559184    582542.22
   18300.927     1.000000       559184          inf
#[Mean    =     1470.201, StdDeviation   =     1980.878]
#[Max     =    18284.544, Total count    =       559184]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  575019 requests in 6.00m, 140.40MB read
  Non-2xx or 3xx responses: 406
Requests/sec:   1597.27
Transfer/sec:    399.36KB
thread 0 made 287591 requests and got 287511 responses
thread 1 made 287588 requests and got 287508 responses

2022-06-07 01:26:02.291 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: NaN 
2022-06-07 01:26:07.687 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.2612723903644225 
2022-06-07 01:26:12.865 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1947261663286004 
2022-06-07 01:26:18.068 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.215526046986721 
2022-06-07 01:26:22.995 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.193335380835381 
2022-06-07 01:26:27.968 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1656884875846503 
2022-06-07 01:26:33.094 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1517960602549246 
2022-06-07 01:26:38.079 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1905135856761424 
2022-06-07 01:26:43.084 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1797434367541766 
2022-06-07 01:26:47.982 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.2064090480678606 
2022-06-07 01:26:52.989 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1452687694358064 
2022-06-07 01:26:58.052 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.18997756170531 
2022-06-07 01:27:03.106 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1740909806390682 
2022-06-07 01:27:08.076 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.156751796910843 
2022-06-07 01:27:13.003 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.173388966156699 
2022-06-07 01:27:18.105 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.221886336154776 
2022-06-07 01:27:23.007 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1339691189827428 
2022-06-07 01:27:28.163 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.200852189244784 
2022-06-07 01:27:33.062 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1607554122524184 
2022-06-07 01:27:38.165 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.22289691943128 
2022-06-07 01:27:43.086 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1631651587179883 
2022-06-07 01:27:48.027 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1869202226345084 
2022-06-07 01:27:53.111 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1894299287410925 
2022-06-07 01:27:58.057 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.20811232449298 
2022-06-07 01:28:02.943 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1617933723196883 
2022-06-07 01:28:08.030 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.191568598242217 
2022-06-07 01:28:13.110 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.140358548316572 
2022-06-07 01:28:18.066 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1768770152003687 
2022-06-07 01:28:22.835 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.187627662678728 
2022-06-07 01:28:27.830 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1294548527961683 
2022-06-07 01:28:32.883 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1324494068388 
2022-06-07 01:28:37.871 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.128678023370407 
2022-06-07 01:28:43.002 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1238974641675856 
2022-06-07 01:28:48.062 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1045863694813547 
2022-06-07 01:28:53.104 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.171164772727273 
2022-06-07 01:28:58.086 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.136132695756127 
2022-06-07 01:29:03.147 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.082411008076578 
2022-06-07 01:29:08.074 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1499522445081185 
2022-06-07 01:29:13.056 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1176992458967914 
2022-06-07 01:29:18.041 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1107701749002765 
2022-06-07 01:29:23.169 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.130669699985781 
2022-06-07 01:29:28.184 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.12294718153573 
2022-06-07 01:29:33.108 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.070080862533693 
2022-06-07 01:29:38.225 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.122824679994247 
2022-06-07 01:29:43.148 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1093261936635432 
2022-06-07 01:29:47.912 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1208390332877336 
2022-06-07 01:29:53.194 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1528444139821796 
2022-06-07 01:29:58.221 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1532221721496168 
2022-06-07 01:30:03.129 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.0885947046843176 
2022-06-07 01:30:08.192 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1413352272727275 
2022-06-07 01:30:13.194 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.105424321959755 
2022-06-07 01:30:18.197 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1139013452914797 
2022-06-07 01:30:23.162 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1190230984257763 
2022-06-07 01:30:28.192 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 2.1073256324023983 
2022-06-07 01:30:32.588 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.631841526045488 
2022-06-07 01:30:37.898 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9203128542280663 
2022-06-07 01:30:43.057 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8912082514734776 
2022-06-07 01:30:47.996 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.976128016789087 
2022-06-07 01:30:52.676 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9386267232237542 
2022-06-07 01:30:57.412 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8773273471543641 
2022-06-07 01:31:03.697 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9594250826761639 
2022-06-07 01:31:08.117 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9785123966942146 
2022-06-07 01:31:12.427 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8944536423841059 
2022-06-07 01:31:17.426 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.900740368929602 
2022-06-07 01:31:22.431 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9262325931501694 
2022-06-07 01:31:27.435 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.94321608040201 
2022-06-07 01:31:32.443 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8812601983180621 
2022-06-07 01:31:37.434 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.905037783375315 
2022-06-07 01:31:42.442 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9411764705882355 
2022-06-07 01:31:47.441 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9216277317256971 
2022-06-07 01:31:52.492 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9261576971214016 
2022-06-07 01:31:57.434 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9146341463414633 
2022-06-07 01:32:02.699 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.8895048506992567 
2022-06-07 01:32:07.431 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: 1.9205607476635516 
2022-06-07 01:32:12.433 INFO  CONSISTENT_HASHING_MODE=true, Imbalance: NaN